In [1]:
pip install html5lib

Requirement already satisfied: html5lib in /usr/local/lib/python3.6/dist-packages (1.0.1)
Requirement already satisfied: webencodings in /usr/local/lib/python3.6/dist-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from html5lib) (1.12.0)

In [2]:
pip install beautifulsoup4

Requirement already satisfied: beautifulsoup4 in /usr/local/lib/python3.6/dist-packages (4.6.3)

In [0]:
import pandas as pd

In [0]:
url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'

In [0]:
dframe_list = pd.io.html.read_html(url) # URL先からHTMLを取得

In [7]:
dframe_list # Pythonのlistで取得される

[                               Bank Name  ...       Closing Date
 0       City National Bank of New Jersey  ...   November 1, 2019
 1                          Resolute Bank  ...   October 25, 2019
 2                  Louisa Community Bank  ...   October 25, 2019
 3                   The Enloe State Bank  ...       May 31, 2019
 4    Washington Federal Bank for Savings  ...  December 15, 2017
 ..                                   ...  ...                ...
 554                   Superior Bank, FSB  ...      July 27, 2001
 555                  Malta National Bank  ...        May 3, 2001
 556      First Alliance Bank & Trust Co.  ...   February 2, 2001
 557    National State Bank of Metropolis  ...  December 14, 2000
 558                     Bank of Honolulu  ...   October 13, 2000

 [559 rows x 6 columns]]

In [11]:
type(dframe_list)

list

In [12]:
len(dframe_list)

1

In [0]:
dframe = dframe_list[0] # listの要素はDataFrame

In [14]:
dframe

                               Bank Name  ...       Closing Date
0       City National Bank of New Jersey  ...   November 1, 2019
1                          Resolute Bank  ...   October 25, 2019
2                  Louisa Community Bank  ...   October 25, 2019
3                   The Enloe State Bank  ...       May 31, 2019
4    Washington Federal Bank for Savings  ...  December 15, 2017
..                                   ...  ...                ...
554                   Superior Bank, FSB  ...      July 27, 2001
555                  Malta National Bank  ...        May 3, 2001
556      First Alliance Bank & Trust Co.  ...   February 2, 2001
557    National State Bank of Metropolis  ...  December 14, 2000
558                     Bank of Honolulu  ...   October 13, 2000

[559 rows x 6 columns]

In [15]:
dframe.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date'],
      dtype='object')